IMSAssociation/IMSAssociationReplaceServiceProfile.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cai3="http://schemas.ericsson.com/cai3g1.2/" xmlns:hss="http://schemas.ericsson.com/ma/HSS/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soapenv:Header>
      <cai3:SessionId>${SessionId}</cai3:SessionId>
   </soapenv:Header>
   <soapenv:Body>
      <cai3:Set>
         <cai3:MOType>IMSAssociation@http://schemas.ericsson.com/ma/HSS/</cai3:MOType>
         <cai3:MOId>
            <hss:associationId>${subscriberId}</hss:associationId>
         </cai3:MOId>
         <cai3:MOAttributes>
            <hss:SetIMSAssociation associationId="${subscriberId}">
               <hss:subscriberServiceProfile serviceProfileId="${serviceProfileId}">
                  <hss:serviceProfileId>${serviceProfileId}</hss:serviceProfileId>
                  <hss:configuredServiceProfile configuredServiceProfileId="${configuredServiceProfileId}">
                     <hss:configuredServiceProfileId>${configuredServiceProfileId}</hss:configuredServiceProfileId>
                  </hss:configuredServiceProfile>
                  <hss:configuredServiceProfile configuredServiceProfileId="OLD_PROFILE" xsi:nil="true"/>
               </hss:subscriberServiceProfile>
            </hss:SetIMSAssociation>
         </cai3:MOAttributes>
      </cai3:Set>
   </soapenv:Body>
</soapenv:Envelope>